---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.Space
source: html/7e8692e9-d4b9-d269-aea1-2f9454da9e9f.htm
---
# Space Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.